Tekla Open API Reference for Tekla Structures 2025
DimensionSetBaseAttributes.DimensionTextAttributes Class
 The DimensionTextAttributes class controls the dimension value representation.
Inheritance Hierarchy
System.Object
 Tekla.Structures.Drawing.GenericAttributesBase
 Tekla.Structures.Drawing.DimensionSetBaseAttributes.DimensionTextAttributes
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
[SerializableAttribute]
public sealed class DimensionTextAttributes : GenericAttributesBase
<SerializableAttribute>
Public NotInheritable Class DimensionTextAttributes
	Inherits GenericAttributesBase
The DimensionSetBaseAttributes.DimensionTextAttributes type exposes the following members.
Constructors
Name | Description
DimensionSetBaseAttributes.DimensionTextAttributes()
 Creates a new dimension text attributes instance. By default the default font is used, no frame is drawn and the value text is above the dimension line.
DimensionSetBaseAttributes.DimensionTextAttributes(FontAttributes, DimensionSetBaseAttributes.FrameTypes, DimensionSetBaseAttributes.DimensionTextPlacings)
 Creates a new dimension text attributes instance with the given parameters.
Top
Properties
Name | Description
Font
 The font attributes.
Frame
 The frame type of the dimension value text.
TextPlacing
 The place of the dimension value text.
Top
Methods
Name | Description
IsEqual
 Compares the current object with an object of the same type.
 (Overrides GenericAttributesBase.IsEqual(Object).)
Top
See Also
Reference
Tekla.Structures.Drawing Namespace